k6/profile/result/stress.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 scenario, 1500 max VUs, 3m40s max duration (incl. graceful stop):
           * default: Up to 1500 looping VUs for 3m10s over 19 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.7s), 0002/1500 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 0002/1500 VUs  0m00.7s/3m10.0s

running (0m01.8s), 0004/1500 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 0004/1500 VUs  0m01.8s/3m10.0s

running (0m02.7s), 0007/1500 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 0007/1500 VUs  0m02.7s/3m10.0s

running (0m03.8s), 0009/1500 VUs, 12 complete and 0 interrupted iterations
default   [   2% ] 0009/1500 VUs  0m03.8s/3m10.0s

running (0m04.7s), 0011/1500 VUs, 21 complete and 0 interrupted iterations
default   [   2% ] 0011/1500 VUs  0m04.7s/3m10.0s

running (0m05.7s), 0013/1500 VUs, 30 complete and 0 interrupted iterations
default   [   3% ] 0013/1500 VUs  0m05.7s/3m10.0s

running (0m06.7s), 0015/1500 VUs, 42 complete and 0 interrupted iterations
default   [   4% ] 0015/1500 VUs  0m06.7s/3m10.0s

running (0m07.7s), 0018/1500 VUs, 56 complete and 0 interrupted iterations
default   [   4% ] 0018/1500 VUs  0m07.7s/3m10.0s

running (0m08.7s), 0020/1500 VUs, 73 complete and 0 interrupted iterations
default   [   5% ] 0020/1500 VUs  0m08.7s/3m10.0s

running (0m09.7s), 0022/1500 VUs, 93 complete and 0 interrupted iterations
default   [   5% ] 0022/1500 VUs  0m09.7s/3m10.0s

running (0m10.7s), 0023/1500 VUs, 112 complete and 0 interrupted iterations
default   [   6% ] 0023/1500 VUs  0m10.7s/3m10.0s

running (0m11.7s), 0023/1500 VUs, 135 complete and 0 interrupted iterations
default   [   6% ] 0023/1500 VUs  0m11.7s/3m10.0s

running (0m12.7s), 0023/1500 VUs, 156 complete and 0 interrupted iterations
default   [   7% ] 0023/1500 VUs  0m12.7s/3m10.0s

running (0m13.7s), 0023/1500 VUs, 177 complete and 0 interrupted iterations
default   [   7% ] 0023/1500 VUs  0m13.7s/3m10.0s

running (0m14.7s), 0023/1500 VUs, 198 complete and 0 interrupted iterations
default   [   8% ] 0023/1500 VUs  0m14.7s/3m10.0s

running (0m15.7s), 0023/1500 VUs, 220 complete and 0 interrupted iterations
default   [   8% ] 0023/1500 VUs  0m15.7s/3m10.0s

running (0m16.7s), 0023/1500 VUs, 242 complete and 0 interrupted iterations
default   [   9% ] 0023/1500 VUs  0m16.7s/3m10.0s

running (0m17.7s), 0023/1500 VUs, 265 complete and 0 interrupted iterations
default   [   9% ] 0023/1500 VUs  0m17.7s/3m10.0s

running (0m18.7s), 0023/1500 VUs, 288 complete and 0 interrupted iterations
default   [  10% ] 0023/1500 VUs  0m18.7s/3m10.0s

running (0m19.7s), 0023/1500 VUs, 309 complete and 0 interrupted iterations
default   [  10% ] 0023/1500 VUs  0m19.7s/3m10.0s

running (0m20.7s), 0024/1500 VUs, 326 complete and 0 interrupted iterations
default   [  11% ] 0024/1500 VUs  0m20.7s/3m10.0s

running (0m21.7s), 0027/1500 VUs, 350 complete and 0 interrupted iterations
default   [  11% ] 0027/1500 VUs  0m21.7s/3m10.0s

running (0m22.7s), 0029/1500 VUs, 376 complete and 0 interrupted iterations
default   [  12% ] 0029/1500 VUs  0m22.7s/3m10.0s

running (0m23.7s), 0031/1500 VUs, 403 complete and 0 interrupted iterations
default   [  12% ] 0031/1500 VUs  0m23.7s/3m10.0s

running (0m24.7s), 0033/1500 VUs, 434 complete and 0 interrupted iterations
default   [  13% ] 0033/1500 VUs  0m24.7s/3m10.0s

running (0m25.7s), 0036/1500 VUs, 466 complete and 0 interrupted iterations
default   [  14% ] 0036/1500 VUs  0m25.7s/3m10.0s

running (0m26.7s), 0038/1500 VUs, 501 complete and 0 interrupted iterations
default   [  14% ] 0038/1500 VUs  0m26.7s/3m10.0s

running (0m27.7s), 0040/1500 VUs, 532 complete and 0 interrupted iterations
default   [  15% ] 0040/1500 VUs  0m27.7s/3m10.0s

running (0m28.7s), 0043/1500 VUs, 571 complete and 0 interrupted iterations
default   [  15% ] 0043/1500 VUs  0m28.7s/3m10.0s

running (0m29.7s), 0045/1500 VUs, 612 complete and 0 interrupted iterations
default   [  16% ] 0045/1500 VUs  0m29.7s/3m10.0s

running (0m30.7s), 0046/1500 VUs, 651 complete and 0 interrupted iterations
default   [  16% ] 0046/1500 VUs  0m30.7s/3m10.0s

running (0m31.7s), 0046/1500 VUs, 689 complete and 0 interrupted iterations
default   [  17% ] 0046/1500 VUs  0m31.7s/3m10.0s

running (0m32.7s), 0046/1500 VUs, 732 complete and 0 interrupted iterations
default   [  17% ] 0046/1500 VUs  0m32.7s/3m10.0s

running (0m33.7s), 0046/1500 VUs, 777 complete and 0 interrupted iterations
default   [  18% ] 0046/1500 VUs  0m33.7s/3m10.0s

running (0m34.7s), 0046/1500 VUs, 822 complete and 0 interrupted iterations
default   [  18% ] 0046/1500 VUs  0m34.7s/3m10.0s

running (0m35.7s), 0046/1500 VUs, 867 complete and 0 interrupted iterations
default   [  19% ] 0046/1500 VUs  0m35.7s/3m10.0s

running (0m36.7s), 0046/1500 VUs, 911 complete and 0 interrupted iterations
default   [  19% ] 0046/1500 VUs  0m36.7s/3m10.0s

running (0m37.7s), 0046/1500 VUs, 955 complete and 0 interrupted iterations
default   [  20% ] 0046/1500 VUs  0m37.7s/3m10.0s

running (0m38.7s), 0046/1500 VUs, 1000 complete and 0 interrupted iterations
default   [  20% ] 0046/1500 VUs  0m38.7s/3m10.0s

running (0m39.7s), 0046/1500 VUs, 1038 complete and 0 interrupted iterations
default   [  21% ] 0046/1500 VUs  0m39.7s/3m10.0s

running (0m40.7s), 0050/1500 VUs, 1083 complete and 0 interrupted iterations
default   [  21% ] 0050/1500 VUs  0m40.7s/3m10.0s

running (0m41.7s), 0055/1500 VUs, 1129 complete and 0 interrupted iterations
default   [  22% ] 0055/1500 VUs  0m41.7s/3m10.0s

running (0m42.7s), 0060/1500 VUs, 1183 complete and 0 interrupted iterations
default   [  22% ] 0060/1500 VUs  0m42.7s/3m10.0s

running (0m43.7s), 0066/1500 VUs, 1237 complete and 0 interrupted iterations
default   [  23% ] 0066/1500 VUs  0m43.7s/3m10.0s

running (0m44.7s), 0071/1500 VUs, 1299 complete and 0 interrupted iterations
default   [  24% ] 0071/1500 VUs  0m44.7s/3m10.0s

running (0m45.7s), 0077/1500 VUs, 1357 complete and 0 interrupted iterations
default   [  24% ] 0077/1500 VUs  0m45.7s/3m10.0s

running (0m46.7s), 0082/1500 VUs, 1428 complete and 0 interrupted iterations
default   [  25% ] 0082/1500 VUs  0m46.7s/3m10.0s

running (0m47.7s), 0087/1500 VUs, 1507 complete and 0 interrupted iterations
default   [  25% ] 0087/1500 VUs  0m47.7s/3m10.0s

running (0m48.7s), 0093/1500 VUs, 1581 complete and 0 interrupted iterations
default   [  26% ] 0093/1500 VUs  0m48.7s/3m10.0s

running (0m49.7s), 0098/1500 VUs, 1670 complete and 0 interrupted iterations
default   [  26% ] 0098/1500 VUs  0m49.7s/3m10.0s

running (0m50.7s), 0100/1500 VUs, 1763 complete and 0 interrupted iterations
default   [  27% ] 0100/1500 VUs  0m50.7s/3m10.0s

running (0m51.7s), 0100/1500 VUs, 1858 complete and 0 interrupted iterations
default   [  27% ] 0100/1500 VUs  0m51.7s/3m10.0s

running (0m52.7s), 0100/1500 VUs, 1955 complete and 0 interrupted iterations
default   [  28% ] 0100/1500 VUs  0m52.7s/3m10.0s

running (0m53.7s), 0100/1500 VUs, 2047 complete and 0 interrupted iterations
default   [  28% ] 0100/1500 VUs  0m53.7s/3m10.0s

running (0m54.7s), 0100/1500 VUs, 2137 complete and 0 interrupted iterations
default   [  29% ] 0100/1500 VUs  0m54.7s/3m10.0s

running (0m55.7s), 0100/1500 VUs, 2226 complete and 0 interrupted iterations
default   [  29% ] 0100/1500 VUs  0m55.7s/3m10.0s

running (0m56.7s), 0100/1500 VUs, 2313 complete and 0 interrupted iterations
default   [  30% ] 0100/1500 VUs  0m56.7s/3m10.0s

running (0m57.7s), 0100/1500 VUs, 2406 complete and 0 interrupted iterations
default   [  30% ] 0100/1500 VUs  0m57.7s/3m10.0s

running (0m58.7s), 0100/1500 VUs, 2491 complete and 0 interrupted iterations
default   [  31% ] 0100/1500 VUs  0m58.7s/3m10.0s

running (0m59.7s), 0100/1500 VUs, 2588 complete and 0 interrupted iterations
default   [  31% ] 0100/1500 VUs  0m59.7s/3m10.0s

running (1m00.7s), 0111/1500 VUs, 2686 complete and 0 interrupted iterations
default   [  32% ] 0111/1500 VUs  1m00.7s/3m10.0s

running (1m01.7s), 0126/1500 VUs, 2780 complete and 0 interrupted iterations
default   [  32% ] 0126/1500 VUs  1m01.7s/3m10.0s

running (1m02.7s), 0141/1500 VUs, 2893 complete and 0 interrupted iterations
default   [  33% ] 0141/1500 VUs  1m02.7s/3m10.0s

running (1m03.7s), 0156/1500 VUs, 3000 complete and 0 interrupted iterations
default   [  34% ] 0156/1500 VUs  1m03.7s/3m10.0s

running (1m04.7s), 0171/1500 VUs, 3124 complete and 0 interrupted iterations
default   [  34% ] 0171/1500 VUs  1m04.7s/3m10.0s

running (1m05.7s), 0186/1500 VUs, 3232 complete and 0 interrupted iterations
default   [  35% ] 0186/1500 VUs  1m05.7s/3m10.0s

running (1m06.7s), 0201/1500 VUs, 3356 complete and 0 interrupted iterations
default   [  35% ] 0201/1500 VUs  1m06.7s/3m10.0s

running (1m07.7s), 0216/1500 VUs, 3477 complete and 0 interrupted iterations
default   [  36% ] 0216/1500 VUs  1m07.7s/3m10.0s

running (1m08.7s), 0231/1500 VUs, 3601 complete and 0 interrupted iterations
default   [  36% ] 0231/1500 VUs  1m08.7s/3m10.0s

running (1m09.7s), 0246/1500 VUs, 3712 complete and 0 interrupted iterations
default   [  37% ] 0246/1500 VUs  1m09.7s/3m10.0s

running (1m10.7s), 0250/1500 VUs, 3839 complete and 0 interrupted iterations
default   [  37% ] 0250/1500 VUs  1m10.7s/3m10.0s

running (1m11.7s), 0250/1500 VUs, 3955 complete and 0 interrupted iterations
default   [  38% ] 0250/1500 VUs  1m11.7s/3m10.0s

running (1m12.7s), 0250/1500 VUs, 4092 complete and 0 interrupted iterations
default   [  38% ] 0250/1500 VUs  1m12.7s/3m10.0s

running (1m13.7s), 0250/1500 VUs, 4218 complete and 0 interrupted iterations
default   [  39% ] 0250/1500 VUs  1m13.7s/3m10.0s

running (1m14.7s), 0250/1500 VUs, 4351 complete and 0 interrupted iterations
default   [  39% ] 0250/1500 VUs  1m14.7s/3m10.0s

running (1m15.7s), 0250/1500 VUs, 4470 complete and 0 interrupted iterations
default   [  40% ] 0250/1500 VUs  1m15.7s/3m10.0s

running (1m16.7s), 0250/1500 VUs, 4602 complete and 0 interrupted iterations
default   [  40% ] 0250/1500 VUs  1m16.7s/3m10.0s

running (1m17.7s), 0250/1500 VUs, 4728 complete and 0 interrupted iterations
default   [  41% ] 0250/1500 VUs  1m17.7s/3m10.0s

running (1m18.7s), 0250/1500 VUs, 4850 complete and 0 interrupted iterations
default   [  41% ] 0250/1500 VUs  1m18.7s/3m10.0s

running (1m19.7s), 0250/1500 VUs, 4980 complete and 0 interrupted iterations
default   [  42% ] 0250/1500 VUs  1m19.7s/3m10.0s

running (1m20.7s), 0268/1500 VUs, 5102 complete and 0 interrupted iterations
default   [  42% ] 0268/1500 VUs  1m20.7s/3m10.0s

running (1m21.7s), 0293/1500 VUs, 5162 complete and 0 interrupted iterations
default   [  43% ] 0293/1500 VUs  1m21.7s/3m10.0s

running (1m22.7s), 0318/1500 VUs, 5272 complete and 0 interrupted iterations
default   [  44% ] 0318/1500 VUs  1m22.7s/3m10.0s

running (1m23.7s), 0343/1500 VUs, 5401 complete and 0 interrupted iterations
default   [  44% ] 0343/1500 VUs  1m23.7s/3m10.0s

running (1m24.7s), 0368/1500 VUs, 5505 complete and 0 interrupted iterations
default   [  45% ] 0368/1500 VUs  1m24.7s/3m10.0s

running (1m25.7s), 0393/1500 VUs, 5612 complete and 0 interrupted iterations
default   [  45% ] 0393/1500 VUs  1m25.7s/3m10.0s

running (1m26.7s), 0418/1500 VUs, 5681 complete and 0 interrupted iterations
default   [  46% ] 0418/1500 VUs  1m26.7s/3m10.0s

running (1m27.7s), 0443/1500 VUs, 5786 complete and 0 interrupted iterations
default   [  46% ] 0443/1500 VUs  1m27.7s/3m10.0s

running (1m28.7s), 0468/1500 VUs, 5897 complete and 0 interrupted iterations
default   [  47% ] 0468/1500 VUs  1m28.7s/3m10.0s

running (1m29.7s), 0493/1500 VUs, 6037 complete and 0 interrupted iterations
default   [  47% ] 0493/1500 VUs  1m29.7s/3m10.0s

running (1m30.7s), 0500/1500 VUs, 6131 complete and 0 interrupted iterations
default   [  48% ] 0500/1500 VUs  1m30.7s/3m10.0s

running (1m31.7s), 0500/1500 VUs, 6253 complete and 0 interrupted iterations
default   [  48% ] 0500/1500 VUs  1m31.7s/3m10.0s

running (1m32.7s), 0500/1500 VUs, 6386 complete and 0 interrupted iterations
default   [  49% ] 0500/1500 VUs  1m32.7s/3m10.0s

running (1m33.7s), 0500/1500 VUs, 6511 complete and 0 interrupted iterations
default   [  49% ] 0500/1500 VUs  1m33.7s/3m10.0s

running (1m34.7s), 0500/1500 VUs, 6653 complete and 0 interrupted iterations
default   [  50% ] 0500/1500 VUs  1m34.7s/3m10.0s

running (1m35.7s), 0500/1500 VUs, 6777 complete and 0 interrupted iterations
default   [  50% ] 0500/1500 VUs  1m35.7s/3m10.0s

running (1m36.7s), 0500/1500 VUs, 6894 complete and 0 interrupted iterations
default   [  51% ] 0500/1500 VUs  1m36.7s/3m10.0s

running (1m37.7s), 0500/1500 VUs, 7036 complete and 0 interrupted iterations
default   [  51% ] 0500/1500 VUs  1m37.7s/3m10.0s

running (1m38.7s), 0500/1500 VUs, 7171 complete and 0 interrupted iterations
default   [  52% ] 0500/1500 VUs  1m38.7s/3m10.0s

running (1m39.7s), 0500/1500 VUs, 7295 complete and 0 interrupted iterations
default   [  52% ] 0500/1500 VUs  1m39.7s/3m10.0s

running (1m40.7s), 0518/1500 VUs, 7416 complete and 0 interrupted iterations
default   [  53% ] 0518/1500 VUs  1m40.7s/3m10.0s

running (1m41.7s), 0543/1500 VUs, 7553 complete and 0 interrupted iterations
default   [  54% ] 0543/1500 VUs  1m41.7s/3m10.0s

running (1m42.7s), 0568/1500 VUs, 7678 complete and 0 interrupted iterations
default   [  54% ] 0568/1500 VUs  1m42.7s/3m10.0s

running (1m43.7s), 0593/1500 VUs, 7790 complete and 0 interrupted iterations
default   [  55% ] 0593/1500 VUs  1m43.7s/3m10.0s

running (1m44.7s), 0618/1500 VUs, 7905 complete and 0 interrupted iterations
default   [  55% ] 0618/1500 VUs  1m44.7s/3m10.0s

running (1m45.7s), 0643/1500 VUs, 8017 complete and 0 interrupted iterations
default   [  56% ] 0643/1500 VUs  1m45.7s/3m10.0s

running (1m46.7s), 0668/1500 VUs, 8135 complete and 0 interrupted iterations
default   [  56% ] 0668/1500 VUs  1m46.7s/3m10.0s

running (1m47.7s), 0693/1500 VUs, 8271 complete and 0 interrupted iterations
default   [  57% ] 0693/1500 VUs  1m47.7s/3m10.0s

running (1m48.7s), 0718/1500 VUs, 8376 complete and 0 interrupted iterations
default   [  57% ] 0718/1500 VUs  1m48.7s/3m10.0s

running (1m49.7s), 0743/1500 VUs, 8497 complete and 0 interrupted iterations
default   [  58% ] 0743/1500 VUs  1m49.7s/3m10.0s

running (1m50.7s), 0750/1500 VUs, 8616 complete and 0 interrupted iterations
default   [  58% ] 0750/1500 VUs  1m50.7s/3m10.0s

running (1m51.7s), 0750/1500 VUs, 8749 complete and 0 interrupted iterations
default   [  59% ] 0750/1500 VUs  1m51.7s/3m10.0s

running (1m52.7s), 0750/1500 VUs, 8880 complete and 0 interrupted iterations
default   [  59% ] 0750/1500 VUs  1m52.7s/3m10.0s

running (1m53.7s), 0750/1500 VUs, 8994 complete and 0 interrupted iterations
default   [  60% ] 0750/1500 VUs  1m53.7s/3m10.0s

running (1m54.7s), 0750/1500 VUs, 9111 complete and 0 interrupted iterations
default   [  60% ] 0750/1500 VUs  1m54.7s/3m10.0s

running (1m55.7s), 0750/1500 VUs, 9258 complete and 0 interrupted iterations
default   [  61% ] 0750/1500 VUs  1m55.7s/3m10.0s

running (1m56.7s), 0750/1500 VUs, 9393 complete and 0 interrupted iterations
default   [  61% ] 0750/1500 VUs  1m56.7s/3m10.0s

running (1m57.7s), 0750/1500 VUs, 9527 complete and 0 interrupted iterations
default   [  62% ] 0750/1500 VUs  1m57.7s/3m10.0s

running (1m58.7s), 0750/1500 VUs, 9647 complete and 0 interrupted iterations
default   [  62% ] 0750/1500 VUs  1m58.7s/3m10.0s

running (1m59.7s), 0750/1500 VUs, 9783 complete and 0 interrupted iterations
default   [  63% ] 0750/1500 VUs  1m59.7s/3m10.0s

running (2m00.7s), 0768/1500 VUs, 9918 complete and 0 interrupted iterations
default   [  64% ] 0768/1500 VUs  2m00.7s/3m10.0s

running (2m01.7s), 0793/1500 VUs, 10039 complete and 0 interrupted iterations
default   [  64% ] 0793/1500 VUs  2m01.7s/3m10.0s

running (2m03.1s), 0828/1500 VUs, 10143 complete and 0 interrupted iterations
default   [  65% ] 0828/1500 VUs  2m03.2s/3m10.0s

running (2m03.7s), 0843/1500 VUs, 10303 complete and 0 interrupted iterations
default   [  65% ] 0843/1500 VUs  2m03.7s/3m10.0s

running (2m04.7s), 0868/1500 VUs, 10441 complete and 0 interrupted iterations
default   [  66% ] 0868/1500 VUs  2m04.7s/3m10.0s

running (2m05.7s), 0893/1500 VUs, 10551 complete and 0 interrupted iterations
default   [  66% ] 0893/1500 VUs  2m05.7s/3m10.0s

running (2m06.7s), 0918/1500 VUs, 10650 complete and 0 interrupted iterations
default   [  67% ] 0918/1500 VUs  2m06.7s/3m10.0s

running (2m07.7s), 0943/1500 VUs, 10754 complete and 0 interrupted iterations
default   [  67% ] 0943/1500 VUs  2m07.7s/3m10.0s

running (2m08.7s), 0968/1500 VUs, 10888 complete and 0 interrupted iterations
default   [  68% ] 0968/1500 VUs  2m08.7s/3m10.0s

running (2m09.7s), 0993/1500 VUs, 11009 complete and 0 interrupted iterations
default   [  68% ] 0993/1500 VUs  2m09.7s/3m10.0s

running (2m10.7s), 1000/1500 VUs, 11141 complete and 0 interrupted iterations
default   [  69% ] 1000/1500 VUs  2m10.7s/3m10.0s

running (2m11.7s), 1000/1500 VUs, 11277 complete and 0 interrupted iterations
default   [  69% ] 1000/1500 VUs  2m11.7s/3m10.0s

running (2m12.7s), 1000/1500 VUs, 11395 complete and 0 interrupted iterations
default   [  70% ] 1000/1500 VUs  2m12.7s/3m10.0s

running (2m13.7s), 1000/1500 VUs, 11509 complete and 0 interrupted iterations
default   [  70% ] 1000/1500 VUs  2m13.7s/3m10.0s

running (2m14.7s), 1000/1500 VUs, 11644 complete and 0 interrupted iterations
default   [  71% ] 1000/1500 VUs  2m14.7s/3m10.0s

running (2m15.7s), 1000/1500 VUs, 11789 complete and 0 interrupted iterations
default   [  71% ] 1000/1500 VUs  2m15.7s/3m10.0s

running (2m16.7s), 1000/1500 VUs, 11916 complete and 0 interrupted iterations
default   [  72% ] 1000/1500 VUs  2m16.7s/3m10.0s

running (2m17.7s), 1000/1500 VUs, 12062 complete and 0 interrupted iterations
default   [  72% ] 1000/1500 VUs  2m17.7s/3m10.0s

running (2m18.7s), 1000/1500 VUs, 12191 complete and 0 interrupted iterations
default   [  73% ] 1000/1500 VUs  2m18.7s/3m10.0s

running (2m19.7s), 1000/1500 VUs, 12310 complete and 0 interrupted iterations
default   [  74% ] 1000/1500 VUs  2m19.7s/3m10.0s

running (2m20.7s), 1018/1500 VUs, 12425 complete and 0 interrupted iterations
default   [  74% ] 1018/1500 VUs  2m20.7s/3m10.0s

running (2m21.7s), 1043/1500 VUs, 12539 complete and 0 interrupted iterations
default   [  75% ] 1043/1500 VUs  2m21.7s/3m10.0s

running (2m22.6s), 1068/1500 VUs, 12681 complete and 0 interrupted iterations
default   [  75% ] 1068/1500 VUs  2m22.7s/3m10.0s

running (2m23.6s), 1093/1500 VUs, 12797 complete and 0 interrupted iterations
default   [  76% ] 1093/1500 VUs  2m23.7s/3m10.0s

running (2m24.6s), 1118/1500 VUs, 12909 complete and 0 interrupted iterations
default   [  76% ] 1118/1500 VUs  2m24.7s/3m10.0s

running (2m25.6s), 1143/1500 VUs, 13022 complete and 0 interrupted iterations
default   [  77% ] 1143/1500 VUs  2m25.7s/3m10.0s

running (2m26.6s), 1168/1500 VUs, 13162 complete and 0 interrupted iterations
default   [  77% ] 1168/1500 VUs  2m26.7s/3m10.0s

running (2m27.6s), 1193/1500 VUs, 13294 complete and 0 interrupted iterations
default   [  78% ] 1193/1500 VUs  2m27.7s/3m10.0s

running (2m28.6s), 1218/1500 VUs, 13403 complete and 0 interrupted iterations
default   [  78% ] 1218/1500 VUs  2m28.7s/3m10.0s

running (2m29.6s), 1243/1500 VUs, 13535 complete and 0 interrupted iterations
default   [  79% ] 1243/1500 VUs  2m29.7s/3m10.0s

running (2m30.6s), 1250/1500 VUs, 13650 complete and 0 interrupted iterations
default   [  79% ] 1250/1500 VUs  2m30.7s/3m10.0s

running (2m31.6s), 1250/1500 VUs, 13769 complete and 0 interrupted iterations
default   [  80% ] 1250/1500 VUs  2m31.7s/3m10.0s

running (2m32.6s), 1250/1500 VUs, 13904 complete and 0 interrupted iterations
default   [  80% ] 1250/1500 VUs  2m32.7s/3m10.0s

running (2m33.6s), 1250/1500 VUs, 14041 complete and 0 interrupted iterations
default   [  81% ] 1250/1500 VUs  2m33.7s/3m10.0s

running (2m34.6s), 1250/1500 VUs, 14167 complete and 0 interrupted iterations
default   [  81% ] 1250/1500 VUs  2m34.7s/3m10.0s

running (2m35.6s), 1250/1500 VUs, 14291 complete and 0 interrupted iterations
default   [  82% ] 1250/1500 VUs  2m35.7s/3m10.0s

running (2m36.6s), 1250/1500 VUs, 14447 complete and 0 interrupted iterations
default   [  82% ] 1250/1500 VUs  2m36.7s/3m10.0s

running (2m37.6s), 1250/1500 VUs, 14577 complete and 0 interrupted iterations
default   [  83% ] 1250/1500 VUs  2m37.7s/3m10.0s

running (2m38.6s), 1250/1500 VUs, 14713 complete and 0 interrupted iterations
default   [  84% ] 1250/1500 VUs  2m38.7s/3m10.0s

running (2m39.6s), 1250/1500 VUs, 14840 complete and 0 interrupted iterations
default   [  84% ] 1250/1500 VUs  2m39.7s/3m10.0s

running (2m40.6s), 1268/1500 VUs, 14973 complete and 0 interrupted iterations
default   [  85% ] 1268/1500 VUs  2m40.7s/3m10.0s

running (2m41.6s), 1293/1500 VUs, 15111 complete and 0 interrupted iterations
default   [  85% ] 1293/1500 VUs  2m41.7s/3m10.0s

running (2m42.6s), 1318/1500 VUs, 15246 complete and 0 interrupted iterations
default   [  86% ] 1318/1500 VUs  2m42.7s/3m10.0s

running (2m43.6s), 1343/1500 VUs, 15386 complete and 0 interrupted iterations
default   [  86% ] 1343/1500 VUs  2m43.7s/3m10.0s

running (2m44.6s), 1368/1500 VUs, 15503 complete and 0 interrupted iterations
default   [  87% ] 1368/1500 VUs  2m44.7s/3m10.0s

running (2m45.6s), 1393/1500 VUs, 15619 complete and 0 interrupted iterations
default   [  87% ] 1393/1500 VUs  2m45.7s/3m10.0s

running (2m46.6s), 1418/1500 VUs, 15741 complete and 0 interrupted iterations
default   [  88% ] 1418/1500 VUs  2m46.7s/3m10.0s

running (2m47.6s), 1443/1500 VUs, 15867 complete and 0 interrupted iterations
default   [  88% ] 1443/1500 VUs  2m47.7s/3m10.0s

running (2m48.6s), 1468/1500 VUs, 16011 complete and 0 interrupted iterations
default   [  89% ] 1468/1500 VUs  2m48.7s/3m10.0s

running (2m49.6s), 1493/1500 VUs, 16129 complete and 0 interrupted iterations
default   [  89% ] 1493/1500 VUs  2m49.7s/3m10.0s

running (2m50.6s), 1500/1500 VUs, 16242 complete and 0 interrupted iterations
default   [  90% ] 1500/1500 VUs  2m50.7s/3m10.0s

running (2m51.6s), 1500/1500 VUs, 16374 complete and 0 interrupted iterations
default   [  90% ] 1500/1500 VUs  2m51.7s/3m10.0s

running (2m52.6s), 1500/1500 VUs, 16500 complete and 0 interrupted iterations
default   [  91% ] 1500/1500 VUs  2m52.7s/3m10.0s

running (2m53.6s), 1500/1500 VUs, 16622 complete and 0 interrupted iterations
default   [  91% ] 1500/1500 VUs  2m53.7s/3m10.0s

running (2m54.6s), 1500/1500 VUs, 16755 complete and 0 interrupted iterations
default   [  92% ] 1500/1500 VUs  2m54.7s/3m10.0s

running (2m55.6s), 1500/1500 VUs, 16906 complete and 0 interrupted iterations
default   [  92% ] 1500/1500 VUs  2m55.7s/3m10.0s

running (2m56.6s), 1500/1500 VUs, 17038 complete and 0 interrupted iterations
default   [  93% ] 1500/1500 VUs  2m56.7s/3m10.0s

running (2m57.6s), 1500/1500 VUs, 17166 complete and 0 interrupted iterations
default   [  94% ] 1500/1500 VUs  2m57.7s/3m10.0s

running (2m58.6s), 1500/1500 VUs, 17309 complete and 0 interrupted iterations
default   [  94% ] 1500/1500 VUs  2m58.7s/3m10.0s

running (2m59.6s), 1500/1500 VUs, 17443 complete and 0 interrupted iterations
default   [  95% ] 1500/1500 VUs  2m59.7s/3m10.0s

running (3m00.6s), 1492/1500 VUs, 17574 complete and 0 interrupted iterations
default   [  95% ] 1492/1500 VUs  3m00.7s/3m10.0s

running (3m01.6s), 1470/1500 VUs, 17724 complete and 0 interrupted iterations
default   [  96% ] 1470/1500 VUs  3m01.7s/3m10.0s

running (3m02.6s), 1441/1500 VUs, 17864 complete and 0 interrupted iterations
default   [  96% ] 1441/1500 VUs  3m02.7s/3m10.0s

running (3m03.6s), 1403/1500 VUs, 17995 complete and 0 interrupted iterations
default   [  97% ] 1403/1500 VUs  3m03.7s/3m10.0s

running (3m04.6s), 1346/1500 VUs, 18131 complete and 0 interrupted iterations
default   [  97% ] 1346/1500 VUs  3m04.7s/3m10.0s

running (3m05.6s), 1269/1500 VUs, 18289 complete and 0 interrupted iterations
default   [  98% ] 1269/1500 VUs  3m05.7s/3m10.0s

running (3m06.6s), 1173/1500 VUs, 18440 complete and 0 interrupted iterations
default   [  98% ] 1173/1500 VUs  3m06.7s/3m10.0s

running (3m07.6s), 1075/1500 VUs, 18581 complete and 0 interrupted iterations
default   [  99% ] 1075/1500 VUs  3m07.7s/3m10.0s

running (3m08.6s), 0929/1500 VUs, 18766 complete and 0 interrupted iterations
default   [  99% ] 0929/1500 VUs  3m08.7s/3m10.0s

running (3m09.6s), 0768/1500 VUs, 18942 complete and 0 interrupted iterations
default   [ 100% ] 0768/1500 VUs  3m09.7s/3m10.0s

running (3m10.6s), 0591/1500 VUs, 19119 complete and 0 interrupted iterations
default ↓ [ 100% ] 0725/1500 VUs  3m10s

running (3m11.6s), 0382/1500 VUs, 19328 complete and 0 interrupted iterations
default ↓ [ 100% ] 0725/1500 VUs  3m10s

running (3m12.6s), 0122/1500 VUs, 19588 complete and 0 interrupted iterations
default ↓ [ 100% ] 0725/1500 VUs  3m10s

running (3m13.0s), 0000/1500 VUs, 19710 complete and 0 interrupted iterations
default ✓ [ 100% ] 0000/1500 VUs  3m10s

     ✓ logged in
     ✓ got profile
     ✓ updated profile
     ✓ changed age

     checks.........................: 100.00% ✓ 98550      ✗ 0
     data_received..................: 16 MB   82 kB/s
     data_sent......................: 25 MB   129 kB/s
     http_req_blocked...............: avg=71.58µs min=902ns       med=1.59µs   max=32.82ms  p(90)=3.35µs  p(95)=4.55µs
     http_req_connecting............: avg=68.01µs min=0s          med=0s       max=32.76ms  p(90)=0s      p(95)=0s
   ✗ http_req_duration..............: avg=1.2s    min=20.53µs     med=415.12ms max=6.17s    p(90)=3.86s   p(95)=4.29s
       { expected_response:true }...: avg=1.2s    min=20.53µs     med=415.12ms max=6.17s    p(90)=3.86s   p(95)=4.29s
     http_req_failed................: 0.00%   ✓ 0          ✗ 78840
     http_req_receiving.............: avg=1.97ms  min=-19660117ns med=313.25µs max=362.47ms p(90)=3.29ms  p(95)=8.39ms
     http_req_sending...............: avg=11.84µs min=4.94µs      med=9.02µs   max=814.83µs p(90)=17.09µs p(95)=28.8µs
     http_req_tls_handshaking.......: avg=0s      min=0s          med=0s       max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=1.2s    min=0s          med=413.69ms max=6.17s    p(90)=3.86s   p(95)=4.29s
     http_reqs......................: 78840   408.583935/s
     iteration_duration.............: avg=5.81s   min=1.03s       med=5.03s    max=20.04s   p(90)=11.75s  p(95)=14.1s
     iterations.....................: 19710   102.145984/s
     vus............................: 29      min=3        max=1500
     vus_max........................: 1500    min=1500     max=1500

time="2021-12-18T09:14:54Z" level=error msg="some thresholds have failed"